{
	"@metadata": {
		"authors": [
			"Amire80",
			"McDutchie",
			"SongNgu.xyz"
		]
	},
	"prefs-profile": "{{Optional}}\nPreferences section header",
	"userprofilev2-desc": "Text that explains the purpose of the extension on Special:Version.",
	"userprofilev2-selectavatar": "Button text for uploading an avatar.",
	"userprofilev2-avatarchanged": "Text that displays in a bubble notification when an avatar has been successfully changed.",
	"userprofilev2-avatardeleted": "Message shown in bubble notification when an avatar has been successfully deleted.",
	"userprofilev2-user-locked": "Warning message shown on profile of a user profile when their account is locked via CentralAuth.",
	"userprofilev2-edit-profile": "Button text for editing your profile details.",
	"userprofilev2-apierror-forbidden": "Error message returned by the API when a user doesn't have permission to change an avatar.",
	"userprofilev2-apierror-invalidpermission": "Error message returned when a user doesn’t have permission to edit another user’s profile information.",
	"userprofilev2-apierror-nofile": "Error message returned by the API when someone tried to change an avatar but no file was sent with the request.",
	"userprofilev2-apierror-ratelimited": "Error message returned by the API when someone is rate limited from uploading images.",
	"userprofilev2-apierror-invalidusername": "Error message returned by the API when someone tried to change the profile of a non-existing user.",
	"userprofilev2-about-me": "Label text for \"about me\" input box",
	"userprofilev2-discord": "Label text for \"discord\" input box",
	"userprofilev2-twitter": "Label text for \"twitter\" input box",
	"userprofilev2-mastodon": "Label text for \"mastodon\" input box",
	"userprofilev2-about-me-placeholder": "Placeholder text for the \"about me\" input box",
	"userprofilev2-discord-placeholder": "Placeholder text for the \"discord\" input box",
	"userprofilev2-twitter-placeholder": "Placeholder text for the \"twitter\" input box",
	"userprofilev2-mastodon-placeholder": "Placeholder text for the \"mastodon\" input box",
	"userprofilev2-about-me-help": "Help text for the \"about me\" username input.",
	"userprofilev2-mastodon-help": "Help text for the \"mastodon\" username input.",
	"userprofilev2-twitter-help": "Help text for the \"twitter\" username input.",
	"userprofilev2-discord-help": "Help text for the \"discord\" username input.",
	"userprofilev2-showglobalgroups": "Label text for checkbox that toggles whether global groups are shown on a profile.",
	"userprofilev2-showglobaleditcount": "Label text for checkbox that toggles whether global edits are shown on a profile.",
	"userprofilev2-showglobalgroupshelp": "Help text for checkbox that toggles whether global groups are shown on a profile.",
	"userprofilev2-showglobaleditcounthelp": "Help text for checkbox that toggles whether global edits are shown on a profile.",
	"userprofilev2-edit": "Label text for profile edit button",
	"userprofilev2-edit-count": "User edit counter",
	"userprofilev2-globaledit-count": "User global edit counter",
	"userprofilev2-editavatar": "Label text for avatar edit popup.",
	"userprofilev2-edit-back": "Alt text for the back buttons in certain places in the profile edit popup.",
	"userprofilev2-deleteavatar": "Label text for the avatar delete button.",
	"userprofilev2-helptext": "Help text for the profile editing interface."
}
